.data 0x0000				      		
	dataset1: .space 40
	dataset2: .space 40
	dataset3: .space 40
	dataset4: .space 40

.text 0x0000
#¼Ä´æÆ÷³õÊ¼»¯				
start:
	lui   $1,0xFFFF	           
        ori   $28,$1,0xF000	   #ÉèÖÃ$28=0xFFFFF000
	lui    $27,0x0000
	ori   $27,$27,0x0000   #³£Êı0,$2ºÍ$27È«³¡¾°²»¶¯

	ori   $5,$27,0x0000     #Êı¾İ¼¯0µØÖ·
	ori   $6,$27,0x0028     #Êı¾İ¼¯1µØÖ·
	ori   $7,$27,0x0050     #Êı¾İ¼¯2µØÖ·
	ori   $8,$27,0x0078     #Êı¾İ¼¯3µØÖ·
	
	

main:
	#show that you are in main
	#lui $26,0xffff
        #ori $26,$26,0xffff
        #sw $26,0xC62($28)
	#lw $22,0xC72($28)

	#ÅĞ¶Ï½øÈëÄÄ¸öÑùÀı
	ori $13,$27,0x0000      
	beq $22,$13,L1number
	ori $13,$27,0x0020
	beq $22,$13,L2
	ori $13,$27,0x0040
	beq $22,$13,L3
	ori $13,$27,0x0060
	beq $22,$13,L4
	ori $13,$27,0x0080
	beq $22,$13,L5
	ori $13,$27,0x00a0
	beq $22,$13,L6
	ori $13,$27,0x00c0
	beq $22,$13,L7
	ori $13,$27,0x00e0
	beq $22,$13,L8
	j main

L1number:
	ori $18,$27,0x0002   #$18µÍ8bit=00000010 
	ori $19,$27,0x0003
	ori  $3,$27,0x0000
	lw $2,0xC70($28)    #ÊäÈë²âÊÔÊı¾İµÄ¸öÊı£¬´æÈë$2,Êı×é³¤¶È
	sw $2,0xC60($28)   
	lw $10,0xC72($28)
	beq $10,$18,L1indata        #×óÊıµÚÆß¸ö¼üÎªÈ·ÈÏ¼ü
	j L1number

	L1indata:  
	#1,save in space1
	ori  $25,$27,0x0000		#$25=0
	lw $9,0xC70($28)		#$9=ÊäÈëµÄÊı
	sw $9,0xC60($28)		#Í¬²½ÏÔÊ¾
	sw $9,0($5)			#´æµ½Êı¾İ¼¯0
	sw $9,0($6)			#´æµ½Êı¾İ¼¯1
	sw $9,0($7)			#´æµ½Êı¾İ¼¯2
	#sw $9,0($8)
	andi $25,$3,1			#È¡$25µÄ×îºó1bit£¬¼´ÅĞ¶Ï$3ÎªÆæÊı»¹ÊÇÅ¼Êı
	addi $25,$25,1                 #ÆæÊı$25=2'b10   Å¼Êı$25=2'b01
	lw $10,0xC72($28)	        
	bne $10,$25,L1indata	#ÆæÊı°ËÉÏÆßÏÂÈ·ÈÏ£¬Å¼ÊıÆßÉÏ°ËÏÂÈ·ÈÏ  
                                                #ÕâÑùÉè¼ÆÊÇÎªÁËÏû¶¶²¦Âë¿ª¹Ø

	addi $5,$5,4			#µØÖ·+4
	addi $6,$6,4
	addi $7,$7,4
	#addi $8,$8,4
	addi $3,$3,1			#¼ÆÊıÆ÷+1

	beq $3,$2,main
	j L1indata

L2:
	ori $18,$27,0x0001     # $18²»±ä£¬Ò»Ö±Îª1
	ori $7,$27,0x0000	# $7 ÊÇÑ­»·±äÁ¿i
	ori $9,$27,0x0000	# $9 ÊÇÑ­»·±äÁ¿j
	ori $1,$27,0x0000
	ori $4,$27,0x0000
	ori $15,$27,0x0000
	ori $3,$27,0x0000
	ori $6,$27,0x0028	#Êı¾İ¼¯1µÄ»ùµØÖ·
	ori $10,$27,0x0000
	ori $11,$27,0x0000
	ori $12,$27,0x0000
	ori $13,$27,0x0000

	loop1:
	add $9,$27,$27    # Ã¿´ÎÖ´ĞĞÍâ²ãÑ­»·¶¼½«ÄÚ²ãÑ­»·µÄÑ­»·±äÁ¿ÖÃÎª0 $9¶ÔÓ¦j
	loop2:
	# »ñÈ¡a[j]
	addi $10,$9,0      
	sll $10,$10,2        # j*4È¡Æ«ÒÆµØÖ·
	addu $1,$10,$6    #a[j]µÄµØÖ·
	lw $15,0($1)  	   #15ÊÇa[j]

	# »ñÈ¡a[j+1]
	addi $10,$9,1    
	sll $10,$10,2
	addu $4,$10,$6
	lw $3,0($4)          	#$3ÀïÃæÊÇa[j+1]

	sltu $11,$15,$3   	#ÎŞ·ûºÅÅÅĞò
	beq $11,$18,skip_2
	# Èç¹ûa[j] < a[j+1],Ìø×ªµ½skip´úÂë¿é,²»½øĞĞ½»»»

	sw $3,0($1)   # ·ñÔò¾ÍÖ´ĞĞÏÂÃæÕâÁ½¾ä£¬½»»»Á½ÕßµÄÖµ
	sw $15,0($4)

	skip_2:
	addi $9,$9,1     # ÄÚ²ãÑ­»·±äÁ¿×ÔÔö£¬ÇÒÅĞ¶ÏÊÇ·ñ»¹Âú×ãÑ­»·Ìõ¼ş
	addi $10,$9,1   # Èç¹ûÂú×ã£¬ÔòÌø×ªµ½loop2
	sub $1,$2,$7    #$1=Êı×é³¤¶È-Íâ²ãÑ­»·±äÁ¿i ¼´Êı×éÄÚµÚ$1ºóÃæµÄÊı¶¼ÅÅºÃĞòÁË
	slt $12,$10,$1   #Èç¹ûj+1<$1£¬¼ÌĞøÄÚ²ãÑ­»·
	beq $12,$18,loop2ş
	addi $7,$7,1     # Èç¹û²»Âú×ã£¬Ôò½«Íâ²ãÑ­»·µÄÑ­»·±äÁ¿×ÔÔö£¬ÇÒÅĞ¶ÏÊÇ·ñ»¹Âú×ãÍâ²ãÑ­»·Ìõ¼ş
	sub $15,$2,$18  #$15=Êı×é³¤¶È-1£¬ÎªÍâ²ãÑ­»·Ò»¹²ÒªÑ­»·µÄ´ÎÊı
	slt $13,$7,$15 
	beq $13,$18,loop1# Èç¹ûÍâ²ãÑ­»·´ÎÊı´ïµ½ÁË£¬ÅÅĞòÍê³É
	j main

L3:
	lui  $27,0x0000  
	ori $27,$27,0x0000     #³£Êı0
	ori $1,$27,0x0050       #Æ¬Çø2»ùµØÖ·
	ori $20,$27,0x0078     #Æ¬Çø3»ùµØÖ·

	ori $3,$27,0x0000   #¶Ô²âÊÔÊıiµÄÑ­»·±äÁ¿
	ori $7,$27,0x0000    #¼Ç×Å²âÊÔÊı×îºóÓĞ¶àÉÙ¸ö0
	ori $8,$27,0x0001     #³£Êı
	ori $11,$27,0x0080 #10000000
	lui $21,0x8000
	ori $21,$21,0x0000 #1, 31'b0000000
	ori $14,$27,0x0008   #³£Êı ÓÃÀ´¼õ$7
	ori $13,$27,0x0002    #³£Êı
	ori $15,$27,0x0000    #²¹Âë½á¹û
	ori $17,$27,0x0000    #ÒÆÎ»Ê±µÄÑ­»·±äÁ¿

	loop:
	ori $7,$27,0x0000
	#lui $19,0x0000
	#ori $19,$19,0x0001
	#sw $19,0xC60($28)

	sll $18,$3,2       #Æ«ÒÆµØÖ·
	add $22,$20,$18    #Æ¬Çø3ÔªËØµØÖ·
	add $18,$1,$18    #Æ¬Çø2ÔªËØµØÖ·
	lw $5,0($18) 	#32bits  È¡³öÔªËØ

	add $15,$27,$5		#copy $5µ½$15
	and $4,$5,$11    #ÅĞ¶ÏÕı¸ºÊı
	addi $3,$3,1       #¼ÆÊıÆ÷£«1
	bne $4,$11,backloop       #Èç¹ûÊÇÕıÊı£¬Ô­Êı²»¶¯´æ»ØÈ¥

	#¸ºÊı£º½ÓÏÂÀ´ÅĞ¶Ï×îºó1ÔÚµÚ¼¸Î»
	add $6,$5,$27   #copy

	loopsrl:
	#lui $19,0x0000
	#ori $19,$19,0x0010
	#sw $19,0xC60($28)

	and $9,$6,$8       #$8£º0x0001
	beq $9,$8,skip     
	srl $6,$6,1
	addi $7,$7,1  #¼Ç×Å×îºóÓĞ¶àÉÙ¸ö0
	j loopsrl

	skip:
	#lui $19,0x0000
	#ori $19,$19,0x0100
	#sw $19,0xC60($28)

	sub $10,$14,$7       #$10=Å×È¥×îºó0µÄÎ»Êı  $14 = 8
	sub $10,$10,$13     #ÓÉÓÚ·ûºÅÎ»ºÍ×îºóÒ»¸ö1Ò²²»ÓÃÈ¡·´£¬ËùÒÔ$10-2   $10=È¡·´BitµÄÎ»Êı

	ori $15,$27,0x0000  #²¹Âë½á¹û´æµ½15
	addi $12,$5,0           #copy

	sll $12,$12,24           #¼Ä´æÆ÷ÀïµÄÖµÊÇ32bit£¬ÏÈ×óÒÆ24Î»²Åµ½ÎÒÃÇÊäÈëµÄÓĞĞ§Î»Êı
	addi $15,$27,1          #¸ºÊı·ûºÅÎ»Îª0
	sll $12,$12,1             #½«Ô­ÊıµÄ·ûºÅÎ»ÒÆ³ö

	addi $17,$27,0          #$17¼ÆÊıÆ÷

	loopsll:   #ÒÆÒª·´×ÅµÄbits
	#lui $19,0x0000           
	#ori $19,$19,0xf000
	#sw $19,0xC60($28)

	beq $27,$10,jump    #Èç¹û·´×ÅµÄbit=0,Ìø¹ı´Ë»·½Ú
	and $9,$12,$21   # $21,$0,0x8000  È¡³ö×î¸ßbit
	srl $9,$9,31         #½«ÆäÓÒÒÆ31Î»
	sll $15,$15,1
	sll $12,$12,1
	sub $16,$8,$9      #$16=1-$9
	add $15,$15,$16   #½«·´×ÅµÄbitÖÃµ½$15µÄ×îµÍÎ»
	addi $17,$17,1      #17 counter
	bne $17,$10,loopsll  

	jump:
	ori $17,$27,0x0000    #¼ÆÊıÆ÷»Ö¸´0
	addi $7,$7,1              #Ö±½ÓÂäÏÂÀ´µÄbitÎª×îºó0¸öÎ»Êı£«×îºóÒ»¸ö1

	looptail:  #ÒÆÒªÖ±½Ó·ÅÏÂÀ´µÄbit
	#lui $19,0x0000
	#ori $19,$19,0x0001
	#sw $19,0xC62($28)

	and $9,$12,$21         #$9={1, 31'b0000000}
	srl $9,$9,31         
	sll $15,$15,1
	sll $12,$12,1
	add $15,$15,$9
	addi $17,$17,1
	bne $17,$7,looptail

	lui $19,0xffff
	ori $19,$19,0xff00
	add $15,$15,$19      #½«Ç°24bitÖÃÎª1

	backloop:
	#lui $19,0x0000
	#ori $19,$19,0x0008
	#sw $19,0xC62($28)

	sw $15,0($18)         #°ÑÊı´æ»ØÈ¥Êı¾İ¼¯2
	sw $15,0($22)		#°ÑÊı´æ½øÊı¾İ¼¯3
	bne $3,$2,loop        #ÅĞ¶ÏÊÇ·ñ¶ÔËùÓĞÊıÈ¡Íê²¹Âë

	ori $12,$27,0x0043    

	eComplement:
	lw $17,0xC72($28)    #ÒòÎª²¹ÂëÖ»ÄÜ×öÒ»´Î£¬ËùÒÔĞèÒª´Ë×´Ì¬½øĞĞµÈ´ı
	beq $17,$12,main     #µÚÆß°Ë¼üÍ¬Ê±´òÆğÀ´»Ømain
	j eComplement


L4:
	ori $18,$27,0x0001     # $18²»±ä£¬Ò»Ö±Îª1
	ori $7,$27,0x0000	# $7 ÊÇÑ­»·±äÁ¿i
	ori $9,$27,0x0000	# $9 ÊÇÑ­»·±äÁ¿j
	ori $1,$27,0x0000
	ori $4,$27,0x0000
	ori $15,$27,0x0000
	ori $3,$27,0x0000
	ori $6,$27,0x0078
	ori $10,$27,0x0000
	ori $11,$27,0x0000
	ori $12,$27,0x0000
	ori $13,$27,0x0000

	#ÕûÌåÊµÏÖºÍµÚÒ»¸öÅÅĞòÒ»Ñù£¬Ö»ÊÇ°Ñstlu¸Ä³ÉÁËstl
	loopp1:
	add $9,$27,$27    # Ã¿´ÎÖ´ĞĞÍâ²ãÑ­»·¶¼½«ÄÚ²ãÑ­»·µÄÑ­»·±äÁ¿ÖÃÎª0 $9¶ÔÓ¦j
	loopp2:
	addi $10,$9,0  # »ñÈ¡a[j]
	sll $10,$10,2
	addu $1,$10,$6
	lw $15,0($1)  #15ÊÇa[j]

	addi $10,$9,1    # »ñÈ¡a[j+1]
	sll $10,$10,2
	addu $4,$10,$6
	lw $3,0($4)    #$3ÀïÃæÊÇa[j+1]

	slt $11,$15,$3
	beq $11,$18,skipp
	#bltu $t2,$t3,skip  # Èç¹ûa[j] < a[j+1],Ìø×ªµ½skip´úÂë¿é,²»½øĞĞ½»»»

	sw $3,0($1)   # ·ñÔò¾ÍÖ´ĞĞÏÂÃæÕâÁ½¾ä£¬½»»»Á½ÕßµÄÖµ
	sw $15,0($4)

	skipp:
	addi $9,$9,1     
	addi $10,$9,1   
	sub $1,$2,$7 
	slt $12,$10,$1
	beq $12,$18,loopp2
	
	addi $7,$7,1     
	sub $15,$2,$18
	slt $13,$7,$15
	beq $13,$18,loopp1
	j main


L5:
	lui   $27,0x0000   #³£Êı0

	ori   $5,$27,0x0028    #Êı¾İ¼¯1µØÖ·
	ori   $20,$27,0x0001  
	ori   $19,$27,0x0080
	
	lw $6,0($5)              #µÚÒ»¸öÊı
	sub $3,$2,$20		#Êı×é³¤¶È-1=×îºóÒ»¸öÊıµÄIndex
	sll $3,$3,2                
	add $13,$5,$3          #$13=×îºóÒ»¸öÔªËØµÄµØÖ·
	lw $7,0($13)
	subu $6,$7,$6          #½á¹û
	sw $6,0xC60($28)    #ÏÔÊ¾
	#state
	lw $10,0xC72($28)
	beq $10,$19,L5  	 #²¦Æğ×óÊıµÚÎå¸ö¼ü»Ømain
	j main

L6:
	lui   $27,0x0000   #³£Êı0

	ori   $5,$27,0x0078
	ori   $20,$27,0x0001
	ori   $19,$27,0x00a0
	
	lw $6,0($5)
	sub $3,$2,$20
	sll $3,$3,2
	add $13,$5,$3     #$13=×îºóÒ»¸öÔªËØµÄµØÖ·
	lw $7,0($13)
	sub $6,$7,$6
	sw $6,0xC60($28)
	#state
	lw $10,0xC72($28)
	beq $10,$19,L6
	j main

L7:
	lui   $27,0x0000  
	ori $23,$27,0x00ff     #24'b0 11111111
	ori   $19,$27,0x00ca    #1100 1010»Ømain
	ori $7,$27,0x00c1        #1100 0001
	ori $8,$27,0x00c2        #1100 0010

	input:
	lw $25,0xC70($28)         #ÊäÈëÊı¾İ¼¯±àºÅ
	sw $25,0xC60($28)
	#state
	lw $10,0xC72($28)
	beq $10,$7,index            #²¦ÉÏµÚ°Ë¸ö¼üÈ·ÈÏ
	j input
	
	index:
	lw $24,0xC70($28)         #ÊäÈëindex
	sw $24,0xC60($28)
	#state
	lw $10,0xC72($28)
	beq $10,$8,setter		#ÆßÉÏ°ËÏÂÈ·ÈÏ
	j index

	setter:
	sll $24,$24,2			#¼ÆËãÆ«ÒÆµØÖ·

	ori $17,$27,0x0001         #¸ù¾İÊı¾İ¼¯±àºÅÅĞ¶Ï»ùµØÖ·µÄÖµ
	beq $17,$25,set1
	ori $17,$27,0x0002
	beq $17,$25,set2
	ori $17,$27,0x0003
	beq $17,$25,set3

	set1:
	ori $5,$27,0x0028		
	add $5,$5,$24			#¼ÆËãÔªËØµØÖ·
	j output
	
	set2:
	ori $5,$27,0x0050
	add $5,$5,$24
	j output

	set3:
	ori $5,$27,0x0078
	add $5,$5,$24
	j output

	output:
	#$5 address start
	#24 index 
	lw $21,0($5)		
	and $21,$23,$21       #È¡×îºó8bits
	sw $21,0xC60($28)    
	#state
	lw $10,0xC72($28)
	beq $10,$19,main  #1100 1001 µÚÎå¸ö¼üÊÇ»Ømain
	j output

L8:
	lui   $27,0x0000                        
	#after concern, left 8 bits
	ori $8,$27,0x00e1           #1110 0001

	ori $20,$27,0x0000
	ori $23,$27,0x0002

	ori $21,$27,0x0050         #Êı¾İ¼¯2»ùµØÖ·
	ori $22,$27,0x00e9		#1110 1001 µÚÎå¸ö¼üÊÇ»Ømain


	#ÊäÈëIndex
	input_8_1:
	#index 
	lw $5,0xC70($28)
	sw $5,0xC60($28)
	#state
	lw $6,0xC72($28)
	bne $6,$8,input_8_1     #£¤8=11100000 ²¦ÆğµÚ°Ë¸ö¼üÈ·ÈÏ

	#index -> index * 4
	sll $26,$5,2

	#change 20,21
	add $20,$20,$26   #µÚ¡¤0¸ö¡¤Êı¾İ¼¯      ÔªËØµØÖ·
	add $21,$21,$26    #µÚ¡¤2¸ö¡¤Êı¾İ¼¯

        #¼ÆËãÊı¾İ¼¯0µÄÏÔÊ¾
	add $19,$5,$27              #´æindex½ø$19
	sll $19,$19,8			#×óÒÆ8Î»
	lw $24,0($20)
	andi $24,$24,0x00ff		#Ö»È¡µÍ8bits
	add $19,$19,$24		#$19[15:8]:index   [7:0]:data

	#¼ÆËãÊı¾İ¼¯2µÄÏÔÊ¾
	add $14,$5,$27
	sll $14,$14,8
	lw $24,0($21)
	andi $24,$24,0x00ff
	add $14,$14,$24

	#set a range to count time
	lui $15,0x0200
	ori $15,$15,0x00ff               #´ó¸ÅÎª5Ãë×óÓÒ
	
	counter:
	addi $10,$27,0
	
	show_0:
	#set a counter and then add up
	addi $10,$10,1                           

	sw $27,0xC62($28)             #ÏÔÊ¾ÎªÊı¾İ¼¯0
	sw $19,0xC60($28)
	bne $10,$15,show_0
	
	addi $10,$27,0
	
	show_2:
	#set a counter and then add up
	addi $10,$10,1

        sw $23,0xC62($28)		#ÏÔÊ¾ÎªÊı¾İ¼¯2
	sw $14,0xC60($28)
	bne $10,$15,show_2

	lw $6,0xC72($28)
	beq $6,$22,main	       #1110 1001 µÚÎå¸ö¼üÊÇ»Ømain
	j counter
	
	

	
	
	
	
	

	